fixtures/vcr_cassettes/payments_invalid_token_create.yml

---
http_interactions:
- request:
    method: post
    uri: https://staging.beyonic.com/api/payments
    body:
      encoding: US-ASCII
      string: phonenumber=%2B256773712831&amount=100.2&currency=UGX&description=Per%20diem%20payment&payment_type=money&callback_url=https%3A%2F%2Fmy.website%2Fpayments%2Fcallback&metadata=%7B'id'%3A%20'1234'%2C%20'name'%3A%20'Lucy'%7D
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Token invalid_key
      Beyonic-Version:
      - v1
      Content-Length:
      - '221'
      Content-Type:
      - application/x-www-form-urlencoded
      User-Agent:
      - Ruby
  response:
    status:
      code: 401
      message: UNAUTHORIZED
    headers:
      Server:
      - nginx/1.6.2
      Date:
      - Wed, 08 Apr 2015 17:14:50 GMT
      Content-Type:
      - application/json
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      X-Xss-Protection:
      - 1; mode=block
      Content-Language:
      - en-us
      X-Content-Type-Options:
      - nosniff
      Strict-Transport-Security:
      - max-age=31536000; includeSubDomains
      Vary:
      - Accept, Accept-Language, Cookie
      Allow:
      - GET, POST, HEAD, OPTIONS
      X-Frame-Options:
      - DENY
      Www-Authenticate:
      - Token
    body:
      encoding: UTF-8
      string: '{"detail": "Invalid token"}'
    http_version: 
  recorded_at: Wed, 08 Apr 2015 17:14:50 GMT
recorded_with: VCR 2.9.3
